package jp.co.ais.trans.common.define;

/** カラム */
public enum  ColEvn{
	
	/** 計上会社コード */	
	COL0,
	/** 計上会社 */	
	COL1,
	/** 部門コード */	
	COL2,
	/** 部門 */	
	COL3,
	/** 科目コード */	
	COL4,
	/** 科目 */	
	COL5,
	/** 補助科目コード */	
	COL6,
	/** 補助科目 */	
	COL7,
	/** 内訳科目コード */	
	COL8,
	/** 内訳科目 */	
	COL9,
	/** 税 */	
	COL10,
	/** 消費税コード */	
	COL11,
	/** 消費税名称 */	
	COL12,
	/** 税率 */	
	COL13,
	/** 金額 */	
	COL41,
	/** 通貨コード */	
	COL38,
	/** 通貨レート */	
	COL39,
	/** 借方金額外貨 */	
	COL44,
	/** 借方金額 */	
	COL14,
	/** 消費税額 */	
	COL15,
	/** 貸方金額外貨 */	
	COL45,
	/** 貸方金額 */	
	COL16,
	/** 行摘要コード */	
	COL17,
	/** 行摘要 */	
	COL18,
	/** 取引先コード */	
	COL19,
	/** 取引先 */	
	COL20,
	/** 社員コード */	
	COL21,
	/** 社員 */	
	COL22,
	/** 管理1コード */	
	COL23,
	/** 管理1 */	
	COL24,
	/** 管理2コード */	
	COL25,
	/** 管理2 */	
	COL26,
	/** 管理3コード */	
	COL27,
	/** 管理3 */	
	COL28,
	/** 管理4コード */	
	COL29,
	/** 管理4 */	
	COL30,
	/** 管理5コード */	
	COL31,
	/** 管理5 */	
	COL32,
	/** 管理6コード */	
	COL33,
	/** 管理6 */	
	COL34,
	/** 発生日 */	
	COL46,	
	/** 非会計明細1 */	
	COL35,
	/** 非会計明細2 */	
	COL36,
	/** 非会計明細3 */	
	COL37,	
	/** 入力金額 */	
	COL40,	
	/** 通貨コード表示 */	
	COL42,
	/** 通貨レート表示 */	
	COL43,	
	/** Bean */			
	COL47

}